Terraform plan for **dev**
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.global_route53_acm: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0defa60f8e7fded27]
module.vpc.aws_eip.nat["ap-northeast-2a"]: Refreshing state... [id=eipalloc-0da1ec57b2559d26e]
data.terraform_remote_state.global_route53_acm: Read complete after 2s
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0d85353e4528513e3]
module.vpc.aws_route_table.data: Refreshing state... [id=rtb-0ef5084df6edc9e09]
module.vpc.aws_subnet.app["goorm-popcorn-dev-private-app-2a"]: Refreshing state... [id=subnet-0895730781b9ec57d]
module.vpc.aws_subnet.data["goorm-popcorn-dev-private-data-2c"]: Refreshing state... [id=subnet-058d6e78e1d87440f]
module.vpc.aws_route_table.app["goorm-popcorn-dev-private-app-2a"]: Refreshing state... [id=rtb-0127394aff9d61f85]
module.vpc.aws_subnet.data["goorm-popcorn-dev-private-data-2a"]: Refreshing state... [id=subnet-07665dff039c2a320]
module.vpc.aws_subnet.app["goorm-popcorn-dev-private-app-2c"]: Refreshing state... [id=subnet-060e1fe73bf534a28]
module.vpc.aws_route_table.app["goorm-popcorn-dev-private-app-2c"]: Refreshing state... [id=rtb-0ec3666d0395be0dc]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-0a83dd83eb91a9450]
module.security_groups.aws_security_group.cache: Refreshing state... [id=sg-0029f35650cb507ff]
module.security_groups.aws_security_group.kafka: Refreshing state... [id=sg-0dc8dc72cdd320fd6]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-08b4bfcb9651767cd]
module.vpc.aws_subnet.public["goorm-popcorn-dev-public-2a"]: Refreshing state... [id=subnet-099a32ad3fbb2f1eb]
module.vpc.aws_subnet.public["goorm-popcorn-dev-public-2c"]: Refreshing state... [id=subnet-0a6ffcbfe15541259]
module.alb.aws_lb_target_group.gateway: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:375896310755:targetgroup/goorm-popcorn-gateway-dev/920fe6f972efd14a]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0770072aec6f693b2]
module.security_groups.aws_security_group.db: Refreshing state... [id=sg-04a8d98d115ab804d]
module.vpc.aws_route_table_association.app["goorm-popcorn-dev-private-app-2c"]: Refreshing state... [id=rtbassoc-0e43cc02bd616b5bd]
module.vpc.aws_route_table_association.app["goorm-popcorn-dev-private-app-2a"]: Refreshing state... [id=rtbassoc-088f724bb9b9dafef]
module.security_groups.aws_security_group_rule.alb_ingress_http: Refreshing state... [id=sgrule-813207257]
module.security_groups.aws_security_group_rule.alb_ingress_https: Refreshing state... [id=sgrule-4242113275]
module.security_groups.aws_security_group_rule.ecs_ingress_from_ecs: Refreshing state... [id=sgrule-1442875951]
module.security_groups.aws_security_group_rule.ecs_egress_cache: Refreshing state... [id=sgrule-399417881]
module.security_groups.aws_security_group_rule.cache_ingress_from_ecs: Refreshing state... [id=sgrule-2933324788]
module.security_groups.aws_security_group_rule.ecs_ingress_from_alb: Refreshing state... [id=sgrule-1655288750]
module.security_groups.aws_security_group_rule.kafka_ingress_from_ecs["9092"]: Refreshing state... [id=sgrule-338533509]
module.security_groups.aws_security_group_rule.kafka_ingress_from_ecs["9094"]: Refreshing state... [id=sgrule-3222209148]
module.security_groups.aws_security_group_rule.alb_egress_ecs: Refreshing state... [id=sgrule-2835272732]
module.security_groups.aws_security_group_rule.ecs_egress_https: Refreshing state... [id=sgrule-2208661872]
module.security_groups.aws_security_group_rule.ecs_egress_kafka["9092"]: Refreshing state... [id=sgrule-3707260844]
module.security_groups.aws_security_group_rule.ecs_egress_kafka["9094"]: Refreshing state... [id=sgrule-1163285711]
module.vpc.aws_nat_gateway.this["ap-northeast-2a"]: Refreshing state... [id=nat-022acb1a830e0c5d8]
module.vpc.aws_route_table_association.data["goorm-popcorn-dev-private-data-2c"]: Refreshing state... [id=rtbassoc-02f67cdd5eebc6673]
module.vpc.aws_route_table_association.data["goorm-popcorn-dev-private-data-2a"]: Refreshing state... [id=rtbassoc-036af580d43d95668]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-0770072aec6f693b21080289494]
module.vpc.aws_route_table_association.public["goorm-popcorn-dev-public-2c"]: Refreshing state... [id=rtbassoc-007894e27d1c2629c]
module.vpc.aws_route_table_association.public["goorm-popcorn-dev-public-2a"]: Refreshing state... [id=rtbassoc-01c5151a35b824eb8]
module.security_groups.aws_security_group_rule.db_ingress_from_ecs: Refreshing state... [id=sgrule-116785311]
module.security_groups.aws_security_group_rule.ecs_egress_db: Refreshing state... [id=sgrule-303458691]
module.vpc.aws_route.app_nat["ap-northeast-2a"]: Refreshing state... [id=r-rtb-0127394aff9d61f851080289494]
module.vpc.aws_route.app_nat["ap-northeast-2c"]: Refreshing state... [id=r-rtb-0ec3666d0395be0dc1080289494]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:375896310755:loadbalancer/app/goorm-popcorn-alb-dev/961fae39c0a7c5bf]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:375896310755:listener/app/goorm-popcorn-alb-dev/961fae39c0a7c5bf/8605680c292f5b50]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:375896310755:listener/app/goorm-popcorn-alb-dev/961fae39c0a7c5bf/2384643c39395c06]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.elasticache.aws_elasticache_replication_group.this will be created
  + resource "aws_elasticache_replication_group" "this" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis replication group for goorm-popcorn-cache-dev"
      + engine                         = "redis"
      + engine_version                 = "7.0"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t4g.micro"
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + parameter_group_name           = (known after apply)
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "goorm-popcorn-cache-dev"
      + security_group_ids             = [
          + "sg-0029f35650cb507ff",
        ]
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "goorm-popcorn-cache-dev-subnet-group"
      + tags                           = {
          + "Name" = "goorm-popcorn-cache-dev"
        }
      + tags_all                       = {
          + "Name" = "goorm-popcorn-cache-dev"
        }
      + transit_encryption_enabled     = false
      + transit_encryption_mode        = (known after apply)
    }

  # module.elasticache.aws_elasticache_subnet_group.this will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "goorm-popcorn-cache-dev-subnet-group"
      + subnet_ids  = [
          + "subnet-058d6e78e1d87440f",
          + "subnet-07665dff039c2a320",
        ]
      + tags        = {
          + "Name" = "goorm-popcorn-cache-dev-subnet-group"
        }
      + tags_all    = {
          + "Name" = "goorm-popcorn-cache-dev-subnet-group"
        }
      + vpc_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```